"use strict";

const express = require("express");
const bodyParser = require("body-parser");
const mongo = require("./configs/mongo");

const app = express();

mongo.initMongoDB();

app.use(bodyParser.json({ limit: "50mb" }));

app.use(require("./routes"));
// const router = require("./routes");

let server = app.listen(8888, () => {
  console.log("server " + 8888);
});

// ระบบจองที่นั่งโรงหนัง

// ในแต่ละวันจะฉายหนัง 3 รอบ
// รอบแรก 09:00
// รอบที่2 12:00
// รอบสุดท้าย 18:00

// โดยสามารถเริ่มจองได้ก่อนหนังเริ่มฉายเท่านั้นถ้าหนังถึงเวลาฉายแล้วไม่สามารถจองได้ต้องจองรอบถัดไป

// โดยราคาที่นั่งแยกเป็น
// - vip 6 ที่นั่ง ที่นั่งละ 500 บาท
// - ที่นั่งปกติ แถว A ถึง C แถวละ 24 ที่นั่ง ราคาที่นั่งละ 220 บาท
// - ที่นั่งปกติ แถว D ถึง F แถวละ 24 ที่นั่ง ราคาที่นั่งละ 180
// - และที่นั่งปกติ แถว G และ H แถวละ 24 ที่นั่ง ราคาที่นั่งละ 140

// สิ่งที่ต้องการ
// - สามารถดูรอบฉายในแต่ละวันได้

// - สามารถแสดงรายละเอียดของหนังได้ ประกอบด้วย ชื่อหนัง, รูป, เรทติ้ง, ประเภทหนัง และพากย์ไทยหรือsound track /*
// - สามารถงดฉายในรอบบางรอบได้
// - สามารถดูที่นั่งในแต่ละรอบได้
// - สามารถจองที่นั่งได้
// - ไม่สามารถจองที่นั่งที่มีคนจองแล้วได้
// - สามารถยกเลิกจองที่นั่งได้
// - สามารถคำนวณราคาที่นั่งที่จองไปแล้วได้
// - สามารถออกตั๋วหนังแต่ละใบได้โดยประกอบด้วย วันที่ที่จอง, ที่นั่งที่จอง, รอบที่จอง และราคาของที่นั่งที่จอง
// - สามารถคำนวณรายได้ในแต่ละวันได้ โดยมีการแสดงรายได้ต่อวันและรายได้ของแต่ละรอบในวันได้
